Repository: engels74/claude-island
Catalog: ClaudeIsland/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: +\(self.hiddenCount) more tool uses
zh_hans: +另外 \(self.hiddenCount) 次工具调用
zh_hant: +另外 \(self.hiddenCount) 次工具呼叫

source: 1 new message
zh_hans: 1 条新消息
zh_hant: 1 則新訊息

source: Accessibility
zh_hans: 辅助功能
zh_hant: 輔助使用

source: Accessibility Permission Required
zh_hans: 需要辅助功能权限
zh_hant: 需要輔助使用權限

source: Allow
zh_hans: 允许
zh_hant: 允許

source: Always Visible
zh_hans: 始终显示
zh_hant: 永遠顯示

source: Auto
zh_hans: 自动
zh_hant: 自動

source: Automatic
zh_hans: 自动
zh_hant: 自動

source: Back
zh_hans: 返回
zh_hant: 返回

source: Background task: \(bgID)
zh_hans: 后台任务：\(bgID)
zh_hant: 背景任務：\(bgID)

source: Both
zh_hans: 两者
zh_hant: 兩者

source: Built-in
zh_hans: 内建
zh_hant: 內建

source: Built-in or Main
zh_hans: 内建或主显示器
zh_hant: 內建或主顯示器

source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

source: Checking...
zh_hans: 检查中...
zh_hant: 檢查中...

source: Claude Code needs your input
zh_hans: Claude Code 等待您的输入
zh_hant: Claude Code 等待您的輸入

source: Claude Island needs Accessibility permission to: • Monitor mouse position to show/hide the notch • Pass clicks through to apps behind the notch To grant permission: 1. Click "Open Settings" below 2. Click the "+" button at the bottom of the list 3. Navigate to and select the Claude Island app bundle 4. Enable the checkbox next to Claude Island Important: If Claude Island is already in the list but not working, remove it first using the "-" button, then add it again using "+".
zh_hans: Claude Island 需要辅助功能权限，以便： • 监测鼠标位置来显示或隐藏刘海 • 将点击事件透传给刘海后方的应用 授予权限的方法： 1. 点击下方“打开设置” 2. 点击列表底部的“+”按钮 3. 找到并选择 Claude Island 应用 4. 打开 Claude Island 旁边的开关 重要提示：如果 Claude Island 已经在列表中但仍无法正常工作，请先用“-”按钮将其移除，再用“+”重新添加。
zh_hant: Claude Island 需要輔助使用權限，以便： • 監測滑鼠位置來顯示或隱藏劉海 • 將點擊事件傳遞給劉海後方的應用程式 授予權限的方法： 1. 點一下下方的「打開設定」 2. 點一下列表底部的「+」按鈕 3. 找到並選取 Claude Island 應用程式 4. 打開 Claude Island 旁邊的開關 重要提示：如果 Claude Island 已經在列表中但仍無法正常運作，請先用「-」按鈕將其移除，再用「+」重新加入。

source: Compacting...
zh_hans: 压缩中...
zh_hant: 壓縮中...

source: Completed
zh_hans: 已完成
zh_hant: 已完成

source: Created
zh_hans: 已创建
zh_hant: 已建立

source: Deny
zh_hans: 拒绝
zh_hant: 拒絕

source: Disabled
zh_hans: 已禁用
zh_hant: 已停用

source: Display
zh_hans: 显示
zh_hant: 顯示

source: Download Update
zh_hans: 下载更新
zh_hant: 下載更新

source: Downloading...
zh_hans: 下载中...
zh_hant: 下載中...

source: Enable
zh_hans: 启用
zh_hant: 啟用

source: Ended
zh_hans: 已结束
zh_hant: 已結束

source: Error
zh_hans: 错误
zh_hant: 錯誤

source: Exit: \(exitCode)
zh_hans: 退出：\(exitCode)
zh_hant: 結束碼：\(exitCode)

source: Extracting...
zh_hans: 解压中...
zh_hant: 解壓中...

source: Failed
zh_hans: 失败
zh_hant: 失敗

source: Fetches real quota from Claude API
zh_hans: 从 Claude API 获取真实额度
zh_hant: 從 Claude API 取得真實額度

source: Go to Terminal
zh_hans: 前往终端
zh_hant: 前往終端

source: Hidden
zh_hans: 隐藏
zh_hant: 隱藏

source: Idle
zh_hans: 空闲
zh_hant: 閒置

source: In Progress
zh_hans: 进行中
zh_hant: 進行中

source: Install & Relaunch
zh_hans: 安装并重新启动
zh_hant: 安裝並重新啟動

source: Installed
zh_hans: 已安装
zh_hant: 已安裝

source: Installing...
zh_hans: 安装中...
zh_hant: 安裝中...

source: Interrupted
zh_hans: 已中断
zh_hant: 已中斷

source: Later
zh_hans: 稍后
zh_hant: 稍後

source: Launch at Login
zh_hans: 登录时启动
zh_hant: 登入時啟動

source: Layout
zh_hans: 布局
zh_hant: 版面配置

source: Left
zh_hans: 左侧
zh_hant: 左側

source: Loading messages...
zh_hans: 正在加载消息...
zh_hant: 正在載入訊息...

source: Loading...
zh_hans: 加载中...
zh_hant: 載入中...

source: Main
zh_hans: 主显示器
zh_hant: 主顯示器

source: Message Claude...
zh_hans: 发送消息给 Claude...
zh_hant: 傳送訊息給 Claude...

source: Mode
zh_hans: 模式
zh_hant: 模式

source: Needs your input
zh_hans: 需要你的输入
zh_hant: 需要你的輸入

source: Never
zh_hans: 从不
zh_hant: 從不

source: No content
zh_hans: 无内容
zh_hant: 無內容

source: No files found
zh_hans: 未找到文件
zh_hant: 未找到檔案

source: No matches found
zh_hans: 未找到匹配项
zh_hant: 未找到符合項目

source: No messages yet
zh_hans: 还没有消息
zh_hant: 還沒有訊息

source: No results found
zh_hans: 未找到结果
zh_hant: 未找到結果

source: No sessions
zh_hans: 没有会话
zh_hant: 沒有工作階段

source: None
zh_hans: 无
zh_hant: 無

source: Notch Auto-Expand
zh_hans: 刘海自动展开
zh_hant: 劉海自動展開

source: Notch Layout
zh_hans: 刘海布局
zh_hant: 劉海版面配置

source: Notification Sound
zh_hans: 通知声音
zh_hant: 通知聲音

source: Off
zh_hans: 关
zh_hant: 關

source: On
zh_hans: 开
zh_hant: 開

source: Open Claude Code in tmux to enable messaging
zh_hans: 请在 tmux 中运行 Claude Code 以启用消息功能
zh_hant: 請在 tmux 中執行 Claude Code 以啟用訊息功能

source: Open Settings
zh_hans: 打开设置
zh_hant: 打開設定

source: Paste image from clipboard
zh_hans: 从剪贴板粘贴图片
zh_hant: 從剪貼簿貼上圖片

source: Paste session key
zh_hans: 粘贴会话密钥
zh_hant: 貼上工作階段金鑰

source: Processing
zh_hans: 处理中
zh_hant: 處理中

source: Processing...
zh_hans: 处理中...
zh_hant: 處理中...

source: Quit
zh_hans: 退出
zh_hant: 結束

source: Ready
zh_hans: 就绪
zh_hant: 就緒

source: Remove image
zh_hans: 移除图片
zh_hant: 移除圖片

source: Reset
zh_hans: 重置
zh_hant: 重設

source: Resets \(resetTime.formatted(date: .omitted, time: .shortened))
zh_hans: 将于 \(resetTime.formatted(date: .omitted, time: .shortened)) 重置
zh_hant: 將於 \(resetTime.formatted(date: .omitted, time: .shortened)) 重設

source: Retry
zh_hans: 重试
zh_hant: 重試

source: Right
zh_hans: 右侧
zh_hant: 右側

source: Run claude in terminal
zh_hans: 在终端中运行 Claude
zh_hant: 在終端中執行 Claude

source: Running agent...
zh_hans: 正在运行智能代理...
zh_hant: 正在執行智慧代理...

source: Screen
zh_hans: 屏幕
zh_hant: 螢幕

source: Session
zh_hans: 会话
zh_hant: 工作階段

source: Session Key
zh_hans: 会话密钥
zh_hant: 工作階段金鑰

source: Session name
zh_hans: 会话名称
zh_hant: 工作階段名稱

source: Shell \(self.result.shellID) terminated
zh_hans: Shell \(self.result.shellID) 已终止
zh_hant: Shell \(self.result.shellID) 已終止

source: Show 5-hour session usage only
zh_hans: 仅显示 5 小时会话用量
zh_hant: 僅顯示 5 小時工作階段用量

source: Show 7-day weekly usage only
zh_hans: 仅显示 7 天周用量
zh_hant: 僅顯示 7 天每週用量

source: Show both session and weekly usage
zh_hans: 同时显示会话和周用量
zh_hant: 同時顯示工作階段與每週用量

source: Show reset time
zh_hans: 显示重置时间
zh_hant: 顯示重設時間

source: Show when minimized
zh_hans: 最小化时显示
zh_hant: 最小化時顯示

source: Sound Suppression
zh_hans: 声音抑制
zh_hant: 聲音抑制

source: Sound always plays
zh_hans: 始终播放声音
zh_hant: 永遠播放聲音

source: Star on GitHub
zh_hans: 在 GitHub 上标星
zh_hant: 在 GitHub 上標星

source: Status: \(self.result.status)
zh_hans: 状态：\(self.result.status)
zh_hant: 狀態：\(self.result.status)

source: Subagent used \(self.tools.count) tools:
zh_hans: 智能代理已使用 \(self.tools.count) 个工具：
zh_hant: 智慧代理已使用 \(self.tools.count) 個工具：

source: Suppresses audio when Claude Island or the terminal is active
zh_hans: 当 Claude Island 或终端活跃时静音
zh_hant: 當 Claude Island 或終端活躍時靜音

source: Suppresses audio when the terminal is visible (≥50% unobscured)
zh_hans: 当终端可见（≥50% 未遮挡）时静音
zh_hant: 當終端可見（≥50% 未遮擋）時靜音

source: Terminal
zh_hans: 终端
zh_hant: 終端機

source: Token Tracking
zh_hans: Token 跟踪
zh_hant: Token 追蹤

source: Token tracking is off
zh_hans: Token 跟踪已关闭
zh_hant: Token 追蹤已關閉

source: Up to date
zh_hans: 已是最新
zh_hant: 已是最新版本

source: Update failed
zh_hans: 更新失败
zh_hant: 更新失敗

source: Updater not initialized
zh_hans: 更新器尚未初始化
zh_hant: 更新程式尚未初始化

source: Use CLI OAuth
zh_hans: 使用 CLI OAuth
zh_hant: 使用 CLI OAuth

source: User modified
zh_hans: 用户已修改
zh_hant: 使用者已修改

source: Verbose Mode
zh_hans: 详细模式
zh_hant: 詳細模式

source: Waiting for approval
zh_hans: 等待批准
zh_hant: 等待批准

source: Waiting: \(desc)
zh_hans: 等待中：\(desc)
zh_hant: 等待中：\(desc)

source: Weekly
zh_hans: 每周
zh_hant: 每週

source: What's New
zh_hans: 更新内容
zh_hant: 更新內容

source: When Focused
zh_hans: 聚焦时
zh_hant: 聚焦時

source: When Visible
zh_hans: 可见时
zh_hant: 可見時

source: Working
zh_hans: 工作中
zh_hant: 執行中

source: Wrote
zh_hans: 已写入
zh_hant: 已寫入

source: You:
zh_hans: 您：
zh_hant: 您：

source: \(self.count) new messages
zh_hans: \(self.count) 条新消息
zh_hant: \(self.count) 則新訊息

source: \(self.result.numFiles) files with matches
zh_hans: \(self.result.numFiles) 个文件有匹配项
zh_hant: \(self.result.numFiles) 個檔案有符合項目

source: \(tools) tools
zh_hans: \(tools) 个工具
zh_hant: \(tools) 個工具

source: file
zh_hans: 文件
zh_hant: 檔案

source: stderr:
zh_hans: 标准错误：
zh_hant: 標準錯誤：

source: … (\(lines.count - self.maxLines) more lines)
zh_hans: …（还有 \(lines.count - self.maxLines) 行）
zh_hant: …（還有 \(lines.count - self.maxLines) 行）

source: … (\(patch.lines.count - 10) more lines)
zh_hans: …（还有 \(patch.lines.count - 10) 行）
zh_hant: …（還有 \(patch.lines.count - 10) 行）

source: … (\(self.lines.count - self.maxLines) more lines)
zh_hans: …（还有 \(self.lines.count - self.maxLines) 行）
zh_hant: …（還有 \(self.lines.count - self.maxLines) 行）

source: … and \(self.files.count - self.limit) more files
zh_hans: … 还有 \(self.files.count - self.limit) 个文件
zh_hant: … 還有 \(self.files.count - self.limit) 個檔案

source: … and \(self.patches.count - 3) more hunks
zh_hans: … 还有 \(self.patches.count - 3) 个代码块
zh_hant: … 還有 \(self.patches.count - 3) 個區塊

source: … and \(self.result.results.count - 5) more results
zh_hans: … 还有 \(self.result.results.count - 5) 个结果
zh_hant: … 還有 \(self.result.results.count - 5) 個結果

source: … and more (truncated)
zh_hans: … 更多内容（已截断）
zh_hant: … 更多內容（已截斷）
